In [1]:
import pandas as pd

## Filter Row

In [4]:
friend_list = [
    ['name', ['John','Jenny','Nate']],
    ['age', [20,30,30]],
    ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_items(friend_list)

In [5]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [8]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

+ 파이썬에서는 인덱싱을 하면 첫번째 인덱스는 포함을 하고 마지막 인덱스는 포함을 하지 않음

In [18]:
df.loc[[0]]

   name  age      job
0  John   20  student

In [19]:
df.loc[[1]]

    name  age        job
1  Jenny   30  developer

In [20]:
df.loc[[2]]

   name  age      job
2  Nate   30  teacher

In [21]:
df.loc[[1,2]]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [22]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

### by column condition

In [24]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [26]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [31]:
df[(df.age > 25) & (df.name=='Nate')]

   name  age      job
2  Nate   30  teacher

## Filter Column

### by index

In [32]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [35]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [36]:
df.iloc[:,0:1]

       0
0   John
1  Jenny
2   Nate

In [37]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [41]:
df = pd.read_csv('https://raw.githubusercontent.com/minsuk-heo/pandas/master/data/friend_list_no_head.csv', header= None, names=['name','age','job'])

In [42]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [43]:
df_filterd = df[['name','age']]

In [44]:
df_filterd

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [45]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [46]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [47]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [50]:
df.filter(regex='b$', axis=1) # 이름이 b로 끝나는 칼럼만 가져옴

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern